gpcm00/power-meter/vendor-header-files/samd21-core/samd21d/include/component/fuses.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* TEMP_LOG_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_TEMP_LOG_WORD_0; /* Offset: 0x00 (R/   32) TEMP_LOG Page Word 0 */
  __I   uint32_t                       FUSES_TEMP_LOG_WORD_1; /* Offset: 0x04 (R/   32) TEMP_LOG Page Word 1 */
} fuses_temp_log_fuses_registers_t;

/* AUX3_FUSES register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x0C];
  __I   uint32_t                       FUSES_AUX3_WORD_3;  /* Offset: 0x0C (R/   32) AUX3 Page Word 3 */
  __I   uint8_t                        Reserved2[0x30];
  __I   uint32_t                       FUSES_AUX3_WORD_16; /* Offset: 0x40 (R/   32) AUX3 Page Word 16 */
  __I   uint32_t                       FUSES_AUX3_WORD_17; /* Offset: 0x44 (R/   32) AUX3 Page Word 17 */
  __I   uint32_t                       FUSES_AUX3_WORD_18; /* Offset: 0x48 (R/   32) AUX3 Page Word 18 */
} fuses_aux3_fuses_registers_t;

/* OTP4_FUSES register API structure */
typedef struct
{
  __I   uint32_t                       FUSES_OTP4_WORD_0;  /* Offset: 0x00 (R/   32) OTP4 Page Word 0 */
  __I   uint32_t                       FUSES_OTP4_WORD_1;  /* Offset: 0x04 (R/   32) OTP4 Page Word 1 */
  __I   uint32_t                       FUSES_OTP4_WORD_2;  /* Offset: 0x08 (R/   32) OTP4 Page Word 2 */
} fuses_otp4_fuses_registers_t;

/* USER_FUSES register API structure */
typedef struct
{
  __IO  uint32_t                       FUSES_USER_WORD_0;  /* Offset: 0x00 (R/W  32) USER Page Word 0 */
  __IO  uint32_t                       FUSES_USER_WORD_1;  /* Offset: 0x04 (R/W  32) USER Page Word 1 */
} fuses_user_fuses_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_FUSES_COMPONENT_H_ */
